# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
# Libraries
import pandas as pd
import numpy as np
from scipy import stats
import matplotlib.pyplot as plt

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [4]:
temp = pd.read_csv("C:\\Users\\beatr\\Documents\\Beatriz\\Ironhack\\lab-subsetting-and-descriptive-stats\\your-code\Temp_States.csv")

#### Print `temp`.

In [13]:
temp.head(20)

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [7]:
temp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   City         7 non-null      object
 1   State        7 non-null      object
 2   Temperature  7 non-null      float64
dtypes: float64(1), object(2)
memory usage: 296.0+ bytes

In [8]:
# We have two types of data: two columns as object and one with numbers as float

#### Select the rows where state is New York.

In [14]:
new_york = temp[temp["State"] == 'New York']
new_york.head()

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [18]:
new_york_mean = np.mean(new_york)
print("The average of temperature is", new_york_mean)

The average of temperature is Temperature    10.740741
dtype: float64

#### Which states and cities have a temperature above 15 degrees Celsius?

In [21]:
above_15 = temp[temp["Temperature"] > 15]
above_15

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [23]:
above_15 = temp[temp["Temperature"] > 15]
above_15["City"]

for city in above_15["City"]:
    print(city)

NYC
Hartford
Treton
Newark

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [74]:
temp[(temp["Temperature"] < 20) & (temp["Temperature"] > 15)]

for city in bewteen_15_20["City"]:
    print(city)

NYC
Hartford

#### Find the mean and standard deviation of the temperature of each state.

In [41]:
#Divide the data in different state dates
new_york = temp[temp["State"] == 'New York']
connecticut = temp[temp["State"] == 'Connecticut']
new_jersey = temp[temp["State"] == 'New Jersey']

#For the mean:
new_york_mean = np.mean(new_york)
connecticut_mean = np.mean(connecticut)
new_jersey_mean = np.mean(new_jersey)

print("The average of temperature in New York is", new_york_mean, 
      "and the average of temperature in Connecticut is", connecticut_mean,
      "and the average of temperature in New Jersey is", new_jersey_mean
     )

#For the standard deviation:
new_york_std = np.std(new_york)
connecticut_std = np.std(connecticut)
new_jersey_std = np.std(new_jersey)

print("The standard deviation of temperature in New York is", new_york_std, 
      "and the standard deviation of temperature in Connecticut is", connecticut_std,
      "and the standard deviation of temperature in New Jersey is", new_jersey_std
     )

The average of temperature in New York is Temperature    10.740741
dtype: float64 and the average of temperature in Connecticut is Temperature    15.833333
dtype: float64 and the average of temperature in New Jersey is Temperature    21.111111
dtype: float64
The standard deviation of temperature in New York is Temperature    6.640897
dtype: float64 and the standard deviation of temperature in Connecticut is Temperature    1.388889
dtype: float64 and the standard deviation of temperature in New Jersey is Temperature    1.111111
dtype: float64

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [42]:
employees = pd.read_csv("C:\\Users\\beatr\\Documents\\Beatriz\\Ironhack\\lab-subsetting-and-descriptive-stats\\your-code\Employee.csv")
employees

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### Explore the data types of the `employees` dataframe. Comment your results.

In [39]:
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        9 non-null      object
 1   Department  9 non-null      object
 2   Education   9 non-null      object
 3   Gender      9 non-null      object
 4   Title       9 non-null      object
 5   Years       9 non-null      int64
 6   Salary      9 non-null      int64
dtypes: int64(2), object(5)
memory usage: 632.0+ bytes

In [43]:
# We have 5 columns as objects and 2 as integer.

#### What's the average salary in this company?

In [44]:
np.mean(employees["Salary"])

48.888888888888886

#### What's the highest salary?

In [45]:
np.max(employees["Salary"])

70

#### What's the lowest salary?

In [46]:
np.min(employees["Salary"])

30

#### Who are the employees with the lowest salary?

In [49]:
employees[employees["Salary"] == np.min(employees["Salary"])]

    Name Department Education Gender    Title  Years  Salary
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find all the information about an employee called David.

In [50]:
employees[employees["Name"] == "David"]

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [60]:
david_salary = employees.loc[employees["Name"] == "David", 'Salary'].iloc[0]
print("David' salary is", david_salary)

David' salary is 30

#### Print all the rows where job title is associate.

In [62]:
employees[employees["Title"] == "associate"]

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [64]:
# Method 1
employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [67]:
# Method 2
employees.iloc[:3]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [72]:
employees[(employees["Title"] == "associate") & (employees["Salary"] > 55)]

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [77]:
employees.groupby(by = "Years").mean()

          Salary
Years
1      35.000000
2      38.333333
3      55.000000
4      35.000000
7      60.000000
8      70.000000

####  What is the average salary per title?

In [82]:
employees.groupby(by = "Title")["Salary"].mean()

Title
VP           70.000000
analyst      32.500000
associate    56.666667
Name: Salary, dtype: float64

####  Find the salary quartiles.

In [87]:
employees.Salary.quantile([0.25,0.5,0.75])

0.25    35.0
0.50    55.0
0.75    60.0
Name: Salary, dtype: float64

#### Is the mean salary different per gender?

In [88]:
employees.groupby(by = "Gender")["Salary"].mean()

Gender
F    47.5
M    50.0
Name: Salary, dtype: float64

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [94]:
employees.groupby(by = "Department").agg(['mean', 'min', 'max'])

               Years         Salary
                mean min max   mean min max
Department
HR          4.666667   2   8  45.00  30  70
IT          4.500000   1   8  48.75  30  70
Sales       2.500000   2   3  55.00  55  55

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [99]:
new_data = employees.groupby(by = "Department")["Salary"].agg(['max', 'min'])
new_data["Difference"] = new_data["max"] - new_data["min"]
new_data

            max  min  Difference
Department
HR           70   30          40
IT           70   30          40
Sales        55   55           0

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [ ]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [ ]:
# your code here

#### What are the highest and lowest purchase prices?

In [ ]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [ ]:
# your code here

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here